'''Задача 4: Петя, Катя и Сережа делают из бумаги журавликов.
 Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок,
   если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
   а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
*Пример:*
6 -> 1  4  1
24 -> 4  16  4
60 -> 10  40  10'''

s1=6
print("Петя, если 6 в общем -",s1//6,"журавликов")
print("Сережа,если 6 в общем -",s1//6,"журавликов")
print("Катя, если 6 в общем -",s1//6*4,"журавликов")

s2=24
print("Петя, если 24 в общем -",s2//6,"журавликов")
print("Сережа, если 24 в общем -",s2//6,"журавликов")
print("Катя, если 24 в общем -",s2//6*4,"журавликов")

s3=60
print("Петя - если 60 в общем",s3//6,"журавликов")
print("Сережа - если 60 в общем",s3//6,"журавликов")
print("Катя - если 60 в общем",s3//6*4,"журавликов")